Convert class diagram from PlantUML to mermaid
